In [2]:
import pandas as pd

In [2]:
%%time
df = pd.read_pickle('/mnt/nfs/work1/jtaneja/jmugyenyi/REG_consumption_data/files_from_bob/REG_transaction_amount_data.pck')

CPU times: user 1min 5s, sys: 47.9 s, total: 1min 53s
Wall time: 2min 3s

In [3]:
df.head()

,consumer_id,meter_serial_number,transaction_date,block_amount,amount,tariff_name
0,170567,7074501490,2017-06-05 19:50:57.083000000,182.0,85.0,Residential
1,170567,7074501490,2017-06-06 05:48:45.640000000,182.0,85.0,Residential
2,170567,7074501490,2017-07-04 10:48:34.670000000,182.0,85.0,Residential
3,170567,7074501490,2017-07-06 19:26:13.043000000,182.0,85.0,Residential
4,170567,7074501490,2017-08-03 19:58:10.777000000,182.0,85.0,Residential

In [4]:
df.tariff_name.unique()

array(['Residential', 'Regulatory_Fee', 'Rura_fee', 'Electricity',
       'Electricity- index-1', 'Residential_Seq', 'TVA tax',
       'Non Residential', 'Non residential_seq', 'Health Facilities_Seq',
       'Health Facilities', 'Hotels_Seq', 'Hotels',
       'Small Industries_Seq', 'Small Industries', 'MV-Line', 'Specific',
       'Broadcasters_Seq', 'Broadcasters', 'WTP and WPS _Seq',
       'WTP and WPS', 'Medium Industries_Seq', 'Medium Industries',
       'Telecom Towers'], dtype=object)

In [4]:
%%time
df_kWh = df[~(df.tariff_name.isin(['TVA tax','Regulatory_Fee','Rura_fee']))].copy()

CPU times: user 51.2 s, sys: 22.7 s, total: 1min 13s
Wall time: 1min 13s

In [5]:
%%time
df_kWh['meter_serial_number_consumer_id'] = df_kWh['meter_serial_number'].astype(str) +'_'+ df_kWh['consumer_id'].astype(str)

CPU times: user 2min 19s, sys: 23.4 s, total: 2min 42s
Wall time: 2min 42s

In [6]:
df_kWh['meter_serial_number_consumer_id'] = df_kWh['meter_serial_number_consumer_id'].str.strip()

In [7]:
df_kWh.head()

,consumer_id,meter_serial_number,transaction_date,block_amount,amount,tariff_name,meter_serial_number_consumer_id
0,170567,7074501490,2017-06-05 19:50:57.083000000,182.0,85.0,Residential,7074501490_170567
1,170567,7074501490,2017-06-06 05:48:45.640000000,182.0,85.0,Residential,7074501490_170567
2,170567,7074501490,2017-07-04 10:48:34.670000000,182.0,85.0,Residential,7074501490_170567
3,170567,7074501490,2017-07-06 19:26:13.043000000,182.0,85.0,Residential,7074501490_170567
4,170567,7074501490,2017-08-03 19:58:10.777000000,182.0,85.0,Residential,7074501490_170567

In [8]:
import pickle
# Load data (deserialize)
with open('/mnt/nfs/work1/jtaneja/jmugyenyi/REG_consumption_data/low_high_customer_ids/low_consumption_indexes.pickle', 'rb') as handle:
    unserialized_data = pickle.load(handle)
unserialized_data

0          1026227726_20130620 094056.655 0002012 7527
1          1026227932_20140204 110413.710 0002015 0372
2                                     1026227932_20170
3          1026227973_20151030 134608.382 0002014 7932
4          1026227981_20161115 160543.806 0002010 6964
                              ...
439012    94100295628_20181129 200025.249 0002025 3024
439013    94100295636_20181122 090225.675 0002023 6291
439014    94100295644_20181129 171228.670 0002025 5296
439015    94100295651_20181113 145806.883 0002023 7285
439016    94100929572_20181026 124105.807 0002013 9770
Name: meter_serial_number_consumer_id, Length: 439017, dtype: object

In [9]:
low = unserialized_data.tolist()

In [10]:
len(low)

439017

In [11]:
df_kWh_low = df_kWh[df_kWh.meter_serial_number_consumer_id.isin(low)]

In [12]:
low_raw = df_kWh_low.meter_serial_number_consumer_id.unique().tolist()

In [13]:
len(low_raw)

439017

In [23]:
df_kWh_low = df_kWh_low[['meter_serial_number_consumer_id','kWh_sold','transaction_date']]

In [24]:
df_kWh_low

,meter_serial_number_consumer_id,kWh_sold,transaction_date
548,1311102881_20181030 154605.193 0002300 7628,2.5,2019-01-22 21:13:34.837000000
4409,1311103970_44432,2.3,2015-09-24 08:52:17.730000000
4410,1311103970_44432,9.3,2016-05-27 14:24:54.067000000
4414,1311103970_44432,6.3,2014-07-10 18:35:55.173000000
4415,1311103970_44432,1.9,2019-11-07 22:32:24.433000000
...,...,...,...
361023551,4182314353_80521,2.4,2018-01-10 19:12:42.177000000
361023552,4182314353_80521,2.1,2016-04-18 17:10:04.517000000
361023553,4182314353_80521,1.4,2017-07-17 17:47:01.510000000
361023554,4182314353_80521,1.9,2017-11-24 18:56:45.580000000
361023555,4182314353_80521,1.4,2018-04-17 10:05:07.810000000

In [14]:
df_amount_low = df_kWh_low[['meter_serial_number_consumer_id','amount','transaction_date']]

In [16]:
df_amount_low

,meter_serial_number_consumer_id,amount,transaction_date
100,7074494019_180930,847.000,2014-09-17 18:46:11.123000000
101,7074494019_180930,296.000,2017-09-29 18:15:30.820000000
102,7074494019_180930,424.000,2014-08-13 11:24:17.647000000
103,7074494019_180930,296.000,2016-07-30 18:36:10.307000000
104,7074494019_180930,381.000,2016-10-10 17:37:39.777000000
...,...,...,...
361029361,7100249908_20120531 102547.363 0002037 7093,253.000,2016-05-11 01:39:03.870000000
361029362,7100249908_20120531 102547.363 0002037 7093,338.000,2016-07-17 18:02:56.037000000
361029363,7100249908_20120531 102547.363 0002037 7093,1335.000,2018-01-06 11:06:00.313000000
361029364,7100249908_20120531 102547.363 0002037 7093,1695.000,2014-08-23 21:21:08.047000000
361029384,7100248785_20121207 075301.849 0002025 5826,105.615,2020-02-28 16:32:57.443000000

In [17]:
df_amount_low.to_pickle('/mnt/nfs/work1/jtaneja/jmugyenyi/REG_consumption_data/low_high_customer_ids/low_consumers_amount_raw.pck'
                    )

## Secondary analysis

In [3]:
%%time
path_dir = '/mnt/nfs/work1/jtaneja/jmugyenyi/REG_consumption_data/low_high_customer_ids/'
df_kWh_high = pd.read_pickle(path_dir+'high_consumers_kWh_raw.pck')
df_amount_high = pd.read_pickle(path_dir+'high_consumers_amount_raw.pck')
# df_kWh_low = pd.read_pickle(path_dir+'low_consumers_kWh_raw.pck')
# df_amount_low = pd.read_pickle(path_dir+'low_consumers_amount_raw.pck')

CPU times: user 18.6 s, sys: 13.5 s, total: 32.1 s
Wall time: 33.2 s

In [8]:
meta_df = pd.read_pickle('/mnt/nfs/work1/jtaneja/jmugyenyi/REG_consumption_data/metadata_folder/REG_metadata_March_3_2021.pck')

In [10]:
meta_df['meter_serial_number_consumer_id'] = meta_df['meter_serial_number'].astype(str) +'_'+ meta_df['consumer_id'].astype(str)

In [12]:
meta_df = meta_df[['meter_serial_number_consumer_id','installation_date']]

In [13]:
meta_df

       meter_serial_number_consumer_id   installation_date
0                           1805931_10 1996-02-15 12:49:26
1                        7099738945_10 1996-02-15 12:49:26
2                       4167724006_100 2006-07-28 12:50:06
3                         1805903_1000 1997-07-11 12:56:44
4                      7099841954_1000 1997-07-11 12:56:44
...                                ...                 ...
811536                4185408475_99998 2009-04-21 08:28:12
811537                4226717199_99998 2009-04-21 08:28:12
811538                7100343958_99998 2009-04-21 08:28:13
811539                4185407121_99999 2009-04-21 08:32:46
811540                7081390531_99999 2009-04-21 08:32:47

[811541 rows x 2 columns]

In [4]:
%%time
df_high = pd.merge(df_kWh_high,df_amount_high,
                  on=['meter_serial_number_consumer_id','transaction_date'],how='inner')
del df_kWh_high, df_amount_high

CPU times: user 1min 52s, sys: 21 s, total: 2min 13s
Wall time: 2min 13s

In [15]:
df_high.meter_serial_number_consumer_id.nunique()

82078

In [24]:
df_high_install.to_pickle('/mnt/nfs/work1/jtaneja/jmugyenyi/REG_consumption_data/low_high_customer_ids/high_consumers_amount_kWhs_install_raw.pck'
                    )

In [16]:
%%time
df_high_install = pd.merge(df_high,meta_df,
                  on=['meter_serial_number_consumer_id',],how='inner')

CPU times: user 13.1 s, sys: 6.01 s, total: 19.2 s
Wall time: 19.1 s

In [19]:
df_high_install.head()

,meter_serial_number_consumer_id,kWh_sold,transaction_date,amount,installation_date
0,1311103467_43239,12.6,2014-06-28 22:15:54.630000000,1695.000,2006-07-20 18:05:48
1,1311103467_43239,12.6,2014-07-05 12:31:28.330000000,1695.000,2006-07-20 18:05:48
2,1311103467_43239,6.3,2015-01-11 10:51:12.577000000,847.000,2006-07-20 18:05:48
3,1311103467_43239,19.0,2015-07-27 20:44:09.003000000,2542.000,2006-07-20 18:05:48
4,1311103467_43239,14.2,2019-03-02 11:44:23.227000000,1267.384,2006-07-20 18:05:48

In [20]:
df_high_install['installation_year'] = df_high_install.installation_date.dt.year

In [23]:
df_high_install = df_high_install[['meter_serial_number_consumer_id','transaction_date','kWh_sold','amount','installation_year']]